external-services-mocks-deprecato/paleo-test/src/main/resources/OSGI-INF/blueprint/b.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
            xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <s:Header>
        <o:Security xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                    s:mustUnderstand="1">
            <u:Timestamp u:Id="_0">
                <u:Created>2015-03-02T16:51:15.850Z</u:Created>
                <u:Expires>2015-03-02T16:56:15.850Z</u:Expires>
            </u:Timestamp>
            <o:UsernameToken u:Id="uuid-8e158374-e7ee-47ee-be2a-354ac771ca30-2">
                <o:Username>R_MARCHE\\SGG.FATTUREPA</o:Username>
                <o:Password
                        o:Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">
                    paleo
                </o:Password>
            </o:UsernameToken>
        </o:Security>
    </s:Header>
    <s:Body>
        <FindOperatori xmlns="http://paleo.regione.marche.it/services/">
            <cognome/>
            <codiceFiscale/>
        </FindOperatori>
    </s:Body>
</s:Envelope>